IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM6_CONTROLSS_G0_EPWM6.xml
	<register id="CONTROLSS_G0_EPWM6_DCFCTL" acronym="CONTROLSS_G0_EPWM6_DCFCTL" offset="0x18E" width="16" description="Digital Compare Filter Control Register">
		<bitfield id="EDGESTATUS" width="3" begin="15" end="13" resetval="0x0" description="Edge Status:  These bits reflect the total number of edges currently captured. When the value matches the EDGECOUNT, the status bits are set to zero. and a TBCLK wide pulse is generated which can then be output on the DCEVTFILT signal. The edge counter can be reset by writing 000 to the EDGECOUNT value:" range="15 - 13" rwaccess="R"/> 
		<bitfield id="EDGECOUNT" width="3" begin="12" end="10" resetval="0x0" description="Edge Count: These bits select how many edges to count before generating a TBCLK wide pulse on the DCEVTFILT signal: 000: no edges, reset current EDGESTATUS bits to 0,0,0 001: 1 edge 010: 2 edges 011: 3 edges 100: 4 edges 101: 5 edges 110: 6 edges 111: 7 edges" range="12 - 10" rwaccess="R/W"/> 
		<bitfield id="EDGEMODE" width="2" begin="9" end="8" resetval="0x0" description="Edge Mode Select: 00: Low To High Edge 01: High To Low Edge 10: Both Edges 11: Reserved" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="EDGEFILTSEL" width="1" begin="6" end="6" resetval="0x0" description="Edge Filter Select: 0: Edge Filter Not Selected 1: Edge Filter Selected" range="6" rwaccess="R/W"/> 
		<bitfield id="PULSESEL" width="2" begin="5" end="4" resetval="0x0" description="Pulse Select For Blanking &#38; Capture Alignment   00: Time-base counter equal to period [TBCTR = TBPRD]  01: Time-base counter equal to zero [TBCTR = 0x00]  10: Time-base counter equal to zero [TBCTR = 0x00] or period [TBCTR = TBPRD]  11: Blank Pulse Mix" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="BLANKINV" width="1" begin="3" end="3" resetval="0x0" description="Blanking Window Inversion   0: Blanking window not inverted  1: Blanking window inverted" range="3" rwaccess="R/W"/> 
		<bitfield id="BLANKE" width="1" begin="2" end="2" resetval="0x0" description="Blanking Window Enable/Disable   0: Blanking window is disabled  1: Blanking window is enabled" range="2" rwaccess="R/W"/> 
		<bitfield id="SRCSEL" width="2" begin="1" end="0" resetval="0x0" description="Filter Block Signal Source Select   00: Source Is DCAEVT1 Signal  01: Source Is DCAEVT2 Signal  10: Source Is DCBEVT1 Signal  11: Source Is DCBEVT2 Signal" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM6_DCCAPCTL" acronym="CONTROLSS_G0_EPWM6_DCCAPCTL" offset="0x190" width="16" description="Digital Compare Capture Control Register">
		<bitfield id="CAPMODE" width="1" begin="15" end="15" resetval="0x0" description="Counter Capture Mode   0: When a DCEVTFILT occurs and the counter capture is enabled, then the current TBCNT value is captured in the active register. When the respective trip event occurs, further trip [capture] events are ignored until the next PRD_eq or CNT_zero event [as selected by the PULSESEL bit in the DCFCTL register] re-triggers the capture mechanism.  If active mode is enabled, via SHDWMODE bit in DCCAPCTL register, CPU reads of this register will return the active register value.  If shadow mode is enabled, via SHDWMODE bit in DCCAPCTL register, the active register is copied to the shadow register on the PRD_eq or CNT_zero event [whichever is selected by PULSESEL bit in DCFCTL register]. CPU reads of this register will return the shadow register value.   1: When a DCEVTFILT occurs and the counter capture is enabled, then the current TBCNT value is captured in the active register. When the respective trip event occurs - it will set the CAPSTS flag and further trip [capture] events are ignored until this bit is cleared. CAPSTS can be cleared by writing to CAPCLR bit in DCCAPCTL register and it re-triggers the capture mechanism.  If active mode is enabled, via SHDWMODE bit in DCCAPCTL register, CPU reads of this register will return the active register value.  If shadow mode is enabled, via SHDWMODE bit in DCCAPCTL register, the active register is copied to the shadow register on the PRD_eq or CNT_zero event [whichever is selected by PULSESEL bit in DCFCTL register]. CPU reads of this register will return the shadow register value." range="15" rwaccess="R/W"/> 
		<bitfield id="CAPCLR" width="1" begin="14" end="14" resetval="0x0" description="DC Capture Latched Status Clear Flag   0: Writing a 0 has no effect.  1: Writing a 1 will clear this CAPSTS [set] condition." range="14" rwaccess="R/W1TS"/> 
		<bitfield id="CAPSTS" width="1" begin="13" end="13" resetval="0x0" description="Latched Status Flag for Capture Event   0: No DC capture event occurred.  1: A DC capture event has occurred." range="13" rwaccess="R"/> 
		<bitfield id="SHDWMODE" width="1" begin="1" end="1" resetval="0x0" description="TBCTR Counter Capture Shadow Select Mode   0: Enable shadow mode. The DCCAP active register is copied to shadow register on a TBCTR = TBPRD or TBCTR = zero event as defined by the DCFCTL[PULSESEL] bit. CPU reads of the DCCAP register will return the shadow register contents.  1: Active Mode. In this mode the shadow register is disabled. CPU reads from the DCCAP register will always return the active register contents." range="1" rwaccess="R/W"/> 
		<bitfield id="CAPE" width="1" begin="0" end="0" resetval="0x0" description="TBCTR Counter Capture Enable/Disable   0: Disable the time-base counter capture.  1: Enable the time-base counter capture." range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM6_DCFOFFSET" acronym="CONTROLSS_G0_EPWM6_DCFOFFSET" offset="0x192" width="16" description="Digital Compare Filter Offset Register ">
		<bitfield id="DCFOFFSET" width="16" begin="15" end="0" resetval="0x0" description="Blanking Window Offset  These 16-bits specify the number of TBCLK cycles from the blanking window reference to the point when the blanking window is applied. The blanking window reference is either period or zero as defined by the DCFCTL[PULSESEL] bit. This offset register is shadowed and the active register is loaded at the reference point defined by DCFCTL[PULSESEL]. The offset counter is also initialized and begins to count down when the active register is loaded. When the counter expires, the blanking window is applied. If the blanking window is currently active, then the blanking window counter is restarted." range="15 - 0" rwaccess="R/W"/>
	</register>
